In [1]:
import pandas as pd

In [10]:
dados = [[1, 2, 3],
         [4, 5, 6],
         [7, 8, 9]
        ]
colunas = ['Coluna1', 'Coluna2', 'Coluna3']
index = ['A', 'B', 'C']
df = pd.DataFrame(data=dados, columns=colunas, index=index, dtype='float64')

In [11]:
df

   Coluna1  Coluna2  Coluna3
A      1.0      2.0      3.0
B      4.0      5.0      6.0
C      7.0      8.0      9.0

In [12]:
#dados aleatórios
import numpy as np

In [14]:
dados2=np.random.randint(low=0, high=20, size=(5,5))

In [15]:
dados2

array([[12,  3, 13, 16,  1],
       [ 8,  8, 10,  5,  4],
       [ 9,  3, 12, 13, 19],
       [ 5,  6,  2, 19,  9],
       [12,  4,  2, 18, 10]])

In [16]:
colunas2 = ['A', 'B', 'C', 'D', 'E']

In [19]:
df2 = pd.DataFrame(data=dados2, columns=colunas2, dtype='float64')

In [20]:
df2

      A    B     C     D     E
0  12.0  3.0  13.0  16.0   1.0
1   8.0  8.0  10.0   5.0   4.0
2   9.0  3.0  12.0  13.0  19.0
3   5.0  6.0   2.0  19.0   9.0
4  12.0  4.0   2.0  18.0  10.0

In [24]:
df3 = pd.read_csv('/home/sol/Documentos/datasets/cidades_brasil.csv')

In [25]:
df3

,codigo_ibge,nome,latitude,longitude,capital,codigo_uf
0,5200050,Abadia de Goiás,-16.75730,-49.4412,0,52
1,3100104,Abadia dos Dourados,-18.48310,-47.3916,0,31
2,5200100,Abadiânia,-16.19700,-48.7057,0,52
3,3100203,Abaeté,-19.15510,-45.4444,0,31
4,1500107,Abaetetuba,-1.72183,-48.8788,0,15
...,...,...,...,...,...,...
5565,2933604,Xique-Xique,-10.82300,-42.7245,0,29
5566,2517407,Zabelê,-8.07901,-37.1057,0,25
5567,3557154,Zacarias,-21.05060,-50.0552,0,35
5568,2114007,Zé Doca,-3.27014,-45.6553,0,21
5569,4219853,Zortéa,-27.45210,-51.5520,0,42

In [27]:
df3['nome']

0           Abadia de Goiás
1       Abadia dos Dourados
2                 Abadiânia
3                    Abaeté
4                Abaetetuba
               ...
5565            Xique-Xique
5566                 Zabelê
5567               Zacarias
5568                Zé Doca
5569                 Zortéa
Name: nome, Length: 5570, dtype: object

In [30]:
df3.codigo_uf

0       52
1       31
2       52
3       31
4       15
        ..
5565    29
5566    25
5567    35
5568    21
5569    42
Name: codigo_uf, Length: 5570, dtype: int64

In [36]:
df2.shape

(5, 5)

In [37]:
df2.drop(0)

      A    B     C     D     E
1   8.0  8.0  10.0   5.0   4.0
2   9.0  3.0  12.0  13.0  19.0
3   5.0  6.0   2.0  19.0   9.0
4  12.0  4.0   2.0  18.0  10.0

In [38]:
df2

      A    B     C     D     E
0  12.0  3.0  13.0  16.0   1.0
1   8.0  8.0  10.0   5.0   4.0
2   9.0  3.0  12.0  13.0  19.0
3   5.0  6.0   2.0  19.0   9.0
4  12.0  4.0   2.0  18.0  10.0

In [39]:
df2 = df2.drop(0)

In [40]:
df2

      A    B     C     D     E
1   8.0  8.0  10.0   5.0   4.0
2   9.0  3.0  12.0  13.0  19.0
3   5.0  6.0   2.0  19.0   9.0
4  12.0  4.0   2.0  18.0  10.0

In [41]:
df2 = df2.drop('E', axis=1)

In [42]:
df2

      A    B     C     D
1   8.0  8.0  10.0   5.0
2   9.0  3.0  12.0  13.0
3   5.0  6.0   2.0  19.0
4  12.0  4.0   2.0  18.0

In [43]:
df2 = df2.drop(['B', 'D'], axis=1)

In [44]:
df2

      A     C
1   8.0  10.0
2   9.0  12.0
3   5.0   2.0
4  12.0   2.0

In [45]:
df2 = df2.drop([1,4])

In [46]:
df2

     A     C
2  9.0  12.0
3  5.0   2.0

In [47]:
#comando drop sempre retorna um novo dataframe
#para retornar o mesmo ou se usa df = df.drop()
#ou df.drop(['column'], implace=True)